# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'aerial'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'dashlane'
cask 'discord'
cask 'docker'
cask 'dozer'
cask 'github'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'keka'
cask 'microsoft-office'
cask 'mysqlworkbench'
cask 'postman'
cask 'notion'
cask 'slack'
cask 'spotify'
cask 'station'
cask 'tableplus'
cask 'tor-browser'
cask 'transmission'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'

# Editors
cask 'phpstorm'
cask 'sublime-text'
cask 'visual-studio-code'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store

